{
  "architectures": [
    "LayoutLMv3ForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "coordinate_size": 128,
  "dtype": "float32",
  "eos_token_id": 2,
  "has_relative_attention_bias": true,
  "has_spatial_attention_bias": true,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-Amount",
    "2": "I-Amount",
    "3": "B-AmountValue",
    "4": "I-AmountValue",
    "5": "B-ItemName",
    "6": "I-ItemName",
    "7": "B-ItemNameValue",
    "8": "I-ItemNameValue",
    "9": "B-Other",
    "10": "I-Other",
    "11": "B-Quantity",
    "12": "I-Quantity",
    "13": "B-QuantityValue",
    "14": "I-QuantityValue",
    "15": "B-UnitPrice",
    "16": "I-UnitPrice",
    "17": "B-UnitPriceValue",
    "18": "I-UnitPriceValue"
  },
  "initializer_range": 0.02,
  "input_size": 224,
  "intermediate_size": 3072,
  "label2id": {
    "B-Amount": 1,
    "B-AmountValue": 3,
    "B-ItemName": 5,
    "B-ItemNameValue": 7,
    "B-Other": 9,
    "B-Quantity": 11,
    "B-QuantityValue": 13,
    "B-UnitPrice": 15,
    "B-UnitPriceValue": 17,
    "I-Amount": 2,
    "I-AmountValue": 4,
    "I-ItemName": 6,
    "I-ItemNameValue": 8,
    "I-Other": 10,
    "I-Quantity": 12,
    "I-QuantityValue": 14,
    "I-UnitPrice": 16,
    "I-UnitPriceValue": 18,
    "O": 0
  },
  "layer_norm_eps": 1e-05,
  "max_2d_position_embeddings": 1024,
  "max_position_embeddings": 514,
  "max_rel_2d_pos": 256,
  "max_rel_pos": 128,
  "model_type": "layoutlmv3",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "patch_size": 16,
  "rel_2d_pos_bins": 64,
  "rel_pos_bins": 32,
  "second_input_size": 112,
  "shape_size": 128,
  "text_embed": true,
  "transformers_version": "4.57.1",
  "type_vocab_size": 1,
  "visual_embed": true,
  "vocab_size": 50265
}
